/*********************************************
Translator.js for AkelPad - Interface language
Version:       2012-09-02
Language:      Russian
Translated by: Infocatcher
*********************************************/
sTxtCaption    = "Переводчик";
sTxtUse        = "Использовать";
sTxtFromLang   = "С языка";
sTxtToLang     = "На язык";
sTxtAutoDetect = "Автоопределение языка";
sTxtTranslate  = "Перевести";
sTxtTranslateP = "Перевести+";
sTxtOptions    = "Параметры";
sTxtSource     = "Исходный текст";
sTxtTarget     = "Переведенный текст";
sTxtSettings   = "Настройки";
sTxtUndo       = "Отменить";
sTxtRedo       = "Повторить";
sTxtCut        = "Вырезать";
sTxtCopyCB     = "Копировать в буфер обмена";
sTxtInsertAP   = "Вставить в AkelPad";
sTxtPasteCB    = "Вставить из буфера обмена";
sTxtPasteAP    = "Вставить из AkelPad'а";
sTxtDelete     = "Удалить";
sTxtSelectAll  = "Выделить все";
sTxtEntireText = "Весь текст";
sTxtInterface  = "Язык интерфейса";
sTxtSourceInCB = "Source text from Clipboard";                                 //new
sTxtSourceWnd  = "Показывать окно с исходным текстом";                         //changed in English: "Show panel with source text"
sTxtLoadText   = "Load source text to panel at start";                         //changed
sTxtImmediate  = "Переводить при запуске";
sTxtWordWrap   = "Перенос строк";
sTxtUseFontAP  = "Использовать Шрифт из AkelPad'а";
sTxtFontAP     = "Шрифт из AkelPad'а";
sTxtFontGUI    = "GUI font";                                                   //new
sTxtSortLang   = "Сортировка языков";
sTxtSortCode   = "По коду";
sTxtSortName   = "По названию";
sTxtOwnKey     = "свой ключ";
sTxtRegister   = "Регистрация:";
sTxtOK         = "ОК";
sTxtCancel     = "Отмена";
sTxtError      = "Ошибка";
sTxtNoText     = "Нет текста для перевода.";
sTxtNoSupport  = "Ваша система не поддерживает XMLHttpRequest.";
sTxtNoInternet = "Проблема с подключением к Интернету.";
sTxtWait       = "Подождите...";
sTxtUndefined  = "Неизвестный";
sTxtRegScripts = "You must register library: Scripts.dll";                     //new
sTxtNoLibrary  = "Can not load library: ";                                     //new

aLangs[ 0][1] = "Африкаанс";
aLangs[ 1][1] = "Арабский";
aLangs[ 2][1] = "Белорусский";
aLangs[ 3][1] = "Болгарский";
aLangs[ 4][1] = "Каталонский";
aLangs[ 5][1] = "Чешский";
aLangs[ 6][1] = "Валлийский";
aLangs[ 7][1] = "Датский";
aLangs[ 8][1] = "Немецкий";
aLangs[ 9][1] = "Греческий";
aLangs[10][1] = "Английский";
aLangs[11][1] = "Esperanto";                                              //new
aLangs[12][1] = "Испанский";
aLangs[13][1] = "Эстонский";
aLangs[14][1] = "Персидский";
aLangs[15][1] = "Финский";
aLangs[16][1] = "Французский";
aLangs[17][1] = "Ирландский";
aLangs[18][1] = "Галисийский";
aLangs[19][1] = "Хинди";
aLangs[20][1] = "Хорватский";
aLangs[21][1] = "Гаитянский креольский";
aLangs[22][1] = "Венгерский";
aLangs[23][1] = "Индонезийский";
aLangs[24][1] = "Исландский";
aLangs[25][1] = "Итальянский";
aLangs[26][1] = "Еврейский";
aLangs[27][1] = "Японский";
aLangs[28][1] = "Корейский";
aLangs[29][1] = "Латынь";
aLangs[30][1] = "Литовский";
aLangs[31][1] = "Латышский";
aLangs[32][1] = "Македонский";
aLangs[33][1] = "Малайский";
aLangs[34][1] = "Мальтийский";
aLangs[35][1] = "Голландский";
aLangs[36][1] = "Норвежский";
aLangs[37][1] = "Польский";
aLangs[38][1] = "Португальский";
aLangs[39][1] = "Румынский";
aLangs[40][1] = "Русский";
aLangs[41][1] = "Словацкий";
aLangs[42][1] = "Словенский";
aLangs[43][1] = "Албанский";
aLangs[44][1] = "Сербский";
aLangs[45][1] = "Шведский";
aLangs[46][1] = "Суахили";
aLangs[47][1] = "Тайский";
aLangs[48][1] = "Филиппинский";
aLangs[49][1] = "Турецкий";
aLangs[50][1] = "Украинский";
aLangs[51][1] = "Вьетнамский";
aLangs[52][1] = "Идиш";
aLangs[53][1] = "Китайский";
aLangs[54][1] = "Китайский Упрощенный";
aLangs[55][1] = "Китайский Традиционный";